In [1]:
import pandas as pd
import pymysql
from sqlalchemy import create_engine

In [2]:
driver = 'mysql+pymysql'
host = "34.90.32.189"
username = 'root'
password = '123456789'
db = "suicides1"
connection_string = f'{driver}://{username}:{password}@{host}/{db}'
connection=create_engine(connection_string)

In [3]:
suicides=pd.read_sql_query("Select * from suicides1;", connection)
suicides.head()

,Country,Year,Gender,Age,Num_Suicides,Population,Suicides/100kPop,GDP/Year,GDP/Capita,Generation
0,Albania,1992,male,35-54 years,12,343800,3.49,709452584,251,Boomers
1,Albania,1992,male,15-24 years,9,263700,3.41,709452584,251,Generation X
2,Albania,1992,male,55-74 years,5,159500,3.13,709452584,251,Silent
3,Albania,1992,male,25-34 years,7,245500,2.85,709452584,251,Boomers
4,Albania,1992,female,15-24 years,7,292400,2.39,709452584,251,Generation X

# Highest & Lowest Number of Suicides/Year

Highest:

In [4]:
suicides_year = suicides.groupby("Year").sum().sort_values("Num_Suicides", ascending=False)
suicides_year.drop(columns=["Population", "Suicides/100kPop", "GDP/Capita"], inplace=True)
suicides_year.head()

      Num_Suicides
Year
1999        256119
2002        256095
2003        256079
2000        255832
2001        250652

Lowest:

In [5]:
suicides_year = suicides.groupby("Year").sum().sort_values("Num_Suicides", ascending=True)
suicides_year.drop(columns=["Population", "Suicides/100kPop", "GDP/Capita"], inplace=True)
suicides_year.head()

      Num_Suicides
Year
1990        193361
1991        198020
2015        203640
1992        211473
1993        221565

# Highest & Lowest Number of Suicides/Country

Highest:

In [6]:
suicides_country = suicides.groupby("Country").sum().sort_values("Num_Suicides", ascending=False)
suicides_country.drop(columns=["Population", "Suicides/100kPop", "GDP/Capita", "Year"], inplace=True)
suicides_country.head()

                    Num_Suicides
Country
Russian Federation       1171821
United States             882286
Japan                     690809
Germany                   291262
Ukraine                   289262

Lowest:

In [7]:
suicides_country = suicides.groupby("Country").sum().sort_values("Num_Suicides", ascending = True)
suicides_country.drop(columns = ["Population", "Suicides/100kPop", "GDP/Capita", "Year"], inplace = True)
suicides_country.head()

                     Num_Suicides
Country
San Marino                      4
Antigua and Barbuda            11
Maldives                       20
Macau                          27
Grenada                        29

# Number of suicides by age range

Sorted:

In [8]:
suicides_age = suicides.groupby("Age").sum()
suicides_age.drop(columns=["Year", "Population", "Suicides/100kPop", "GDP/Capita"], inplace=True)
suicides_age.sort_values("Num_Suicides", ascending=False)

             Num_Suicides
Age
35-54 years       2240109
55-74 years       1492138
25-34 years       1006318
15-24 years        721009
75+ years          580984
5-14 years          47414